export default {
    'GET /api/map/line': {
        "data": [{
            "name": "海门",
            "value": [121.15, 31.89, 9]
        },
        {
            "name": "鄂尔多斯",
            "value": [109.781327, 39.608266, 12]
        },
        {
            "name": "招远",
            "value": [120.38, 37.35, 12]
        },
        {
            "name": "舟山",
            "value": [122.207216, 29.985295, 12]
        },
        {
            "name": "齐齐哈尔",
            "value": [123.97, 47.33, 14]
        },
        {
            "name": "盐城",
            "value": [120.13, 33.38, 15]
        },
        {
            "name": "赤峰",
            "value": [118.87, 42.28, 16]
        }],
        "errmsg": "success",
        "errno": 0
    }
}