import React from 'react';
import { Modal } from 'antd-mobile';
import style from './Register.less';

export const RegisterAgree = (): void => {
    const content: React.ReactNode = (
        <div className={style.agreeContent}>
            @@@用户服务协议<br />
            1.1 <br />
            @@@(###)的各项网络服务的所有权和运营权归@@@所有。
            @@@依照本服务条款及其不时发布的操作规则提供网络服务，此外，当服务使用者(以下称“用户”)使用@@@各项分类服务时， 用户应当同意本服务条款的全部内容并遵守与该项服务相关的规则与要点。
            前述所有规则与要点均构成本服务条款的一部分。
            用户必须完全同意所有服务条款并完成注册程序，才能成为@@@的正式用户。
            @@@：服务条款 关于网站服务内容<br />
            2.1 <br />
            @@@网络服务的具体内容由@@@根据实际情况提供，包括但不限于文字、图片、视频、用户、空间、小组等信息和频道。
             @@@保留随时变更、中断或终止部分或全部网络服务的权利。
             本网为用户提供的电子信息空间是为用户储存信息而设，用户有权在合法范围内自由上传、储存电子信息，用户所上传信息的行为并非约稿范畴之列而系自发行为，本网无需对此支付任何费用。<br />
            2.2 <br />本网站的内容主要来自注册用户所发表的文章。
            本网站用户以任何形式上传、发布于本网站的信息内容，为用户个人行为，仅代表用户或作者个人观点，与本站立场无关。
            用户自行承担其上传的信息内容产生的一切法律责任。如果第三方对该内容提出包括版权在内的异议，本站应核实第三方的权利请求，将该内容删除。
            2.3 在本网站公共论坛发布内容时，请严格遵守《中华人民共和国著作权法》；转贴文章， 请注明原始出处和时间，并注意原作者的版权声明，用户需承担转贴可能引起的版权责任。
            2.4 用户理解@@@仅提供相关的网络服务， 除此之外与相关网络服务有关的设备(如电脑、调制解调器及其他与接入互联网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费)均应由用户自行负担。
             用户理解并同意：@@@有权决定授予用户使用电子空间的大小并有权根据公司经营情况而减少或增加用户的电子使用空间或决定是否转为有偿服务。
            @@@：服务条款 服务的变更、中断或终止
            3.1 鉴于网络服务的特殊性，@@@有权随时变更或中断或终止部分或全部网络服务，不需对用户或第三方负责。
            3.2 为了网站的正常运行， @@@定期或不定期地对提供网络服务的平台(如互联网网站、移动网络等)或相关的设备进行检修或者维护而造成网络服务的中断，
            @@@将尽力避免服务中断或将中断时间限制在最短时间内，在合理时间内的服务中断，@@@无需为此承担任何责任。
            3.3 如发生下列任何一种情形，@@@有权随时中断或终止向用户提供网络服务(含封禁帐号、IP等)而无需对用户或任何第三方承担任何责任：
            (1)用户提供的资料不真实；
            (2)利用本网服务损害他人的知识产权或名誉权等合法权利。
            (3)用户经本网要求(包括但不限于因用户发布信息侵权等事因)而拒绝提供真实姓名、住址、联系方式等信息。
            (4)用户有违反本服务条款规定的其他行为；
            3.4 @@@有权决定对曾经免费使用的业务收取相应的费用。在此情况下，@@@会提前10天在网站进行公告。 如用户拒绝支付该费用，@@@有权中断所提供的网络服务。
            @@@：服务条款 网上注册
            4.1 用户在申请使用@@@网络服务时，必须向@@@提供准确的个人资料，如个人资料有任何变动，必须及时更新。
             用户一旦注册成功，成为@@@的合法用户，将得到一个密码和用户名。每个用户应当对以其用户名进行的所有活动和事件承担全部责任。
            @@@：服务条款 用户名、用户密码和安全性
            5.1 用户将对用户名和密码安全承担全部责任。用户可随时根据提示改变用户的密码。
             用户不应将其帐号、密码转让或出借予他人使用。如用户发现其帐号遭他人非法使用或存在安全漏洞的情况，应立即通知@@@。 因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，@@@不承担任何责任。
            5.2 如用户注册的免费网络服务的帐号在任何连续 180 日内未实际使用，则@@@有权删除该帐号并停止为该用户提供相关的网络服务。
            @@@：服务条款 用户隐私制度
            6.1 尊重和保护用户个人隐私是@@@的一项基本政策。 @@@不会在未经合法用户授权时对外披露用户注册资料及用户保存在@@@中的非公开内容，但下列情况除外：
            (1) 事先获得用户的明确授权；
            (2) 根据有关法律法规的规定或相关政府主管部门的要求；
            (3) 为维护社会公共利益的需要；
            (4) 为维护@@@的合法权益。
            @@@：服务条款 对用户的管理
            7.1 用户必须遵守以下原则
            (1) 遵守中国有关法律和法规；
            (2) 遵守所有使用网络服务的网络协议、规定、程序和惯例；
            (3) 不得为任何非法目的而使用网络服务系统；
            (4) 不得传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗的、淫秽的、教唆他人实施犯罪行为等非法的信息资料；
            (5) 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权、肖像权及其他任何合法权益；
            此外，本网有权对用户发布的可能导致社会负面影响的敏感信息予以删除(本网有权对是否为敏感信息进行认定)。 本网站有权认定和删除提交者所提交的任何不符合国家法律、法规和政策的任何言论、文字和图片。
            (6) 不得利用@@@网络服务系统进行任何不利于@@@的行为；
            (7) 不干扰或混乱网络服务；
            (8) 未经许可不得非法进入其它电脑系统。
            (9) 不得恶意修改他人上传的信息。
            用户应严格遵守如上内容，违规用户将受到包括信用扣除、封禁帐号、IP等不同形式的处罚。
            7.2 用户需独立对自己在网上的行为承担法律责任。
            若用户的行为不符合上述服务条款，@@@有权做出独立判断立即取消用户服务帐号， 用户若在@@@网上散布和传播反动、色情或其他违反国家法律的信息，@@@的系统记录有可能作为用户违反法律的证据。
            7.3 @@@不对用户所发布信息的删除或储存失败承担任何责任。
            @@@有权判定用户的行为是否符合中国法律法规的规定以及@@@服务条款的要求， 如果用户违背了中国法律法规的规定或服务条款的规定，@@@有中断对其提供服务的权利。
            7.4 对于用户通过@@@网络技术服务(包括但不限于文字、图片、视频、用户、空间、小组等信息和频道)上传到@@@网上可公开获取区域的任何内容，
             用户同意授予@@@在全世界范围内永久性的、不可撤销的、免费的使用权和进行再许可的权利(包括开发和运营各类电信增值业务及无线互联网业务， 如：短信、彩信、WAP、IVR、手机报、手机客户端等形式)。
            7.5 用户同意：本网站中的内容除作者申明保留版权或该内容从其他网站转载而附带有原所有站的版权声明者，
             其内容的复制权、发行权、信息网络传播权、改编权、翻译权、汇编权等权利归@@@所有，@@@有权就第三方的侵权行为独立提起诉讼并取得收益。
            7.6 用户上传本网站的信息内容视为许可本站以合理的方式使用，
             本站有权对其中精彩的图文进行推广(含站内首页、子频道等链接推广或编辑出版等)而无需对此支付任何费用。
              此外，用户对本网为推广市场授权他人使用其图文的行为表示理解并承诺不收取任何费用，@@@可授权第三方标示来源“@@@”，用户愿意以此作为对网站做出的贡献。
            @@@：服务条款 关于内容所有权
            8.1 @@@对其独立采编的或从第三方获得合法许可的信息内容， 包括但不限于文字、软件、声音、图片、录像、图表等，拥有所有权和合法使用权。 所有这些内容受版权、商标和其它财产所有权法律的保护。
            8.2 用户只有在获得@@@或其他相关权利人的授权之后才能使用这些内容，而不能擅自复制、传播、修改这些内容、 或未经@@@及其他有权许可方书面许可创造与上述内容有关的派生内容或产品。
             个人网站转载刊登@@@文章图片，请在文章题目附近用显要字体写明来自@@@并链接到 ###。 除合理使用外，未经许可，任何人不得大规模复制本网内容；
            8.3 已经载本站原创文章图片的媒体或者商业网站，除了@@@的合作者外， 请在文章图片题目附近用显要字体写明来自@@@并链接到 ### ， 对此，@@@仍然保留索取费用的权利；
            8.4 关于图片：本站独立拍摄的图片任何媒体及网站均可以在不删除版权标志及标明出处的前提下使用，但本网站不排除会收取一定的费用。
            @@@：服务条款 免责声明
            @@@在我们能知悉的范围内努力保证所有采写文章的真实性和正确性，但不对真实性和正确性做任何保证。
             本站采写文章图片如果和事实有所出入，本站不承担连带责任；本网站所刊载的文章资料、图片、图表仅供参考使用。
              本站所刊载的内容，并不代表同意其说法或描述，仅为提供更多信息，也不构成任何投资建议、医疗建议等。
               用户同意对@@@网络服务的使用承担全部风险，并对因其使用@@@网络服务而产生的一切后果承担全部风险，
                @@@对用户不作任何类型的担保，也不承担任何责任。
                 @@@不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对服务的及时性、安全性、准确性都不作担保。
                  对于因不可抗力或@@@不能避免或控制的原因造成的网络服务中断或其它缺陷，@@@不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
            9.1 @@@采用的非本站原创文章图片等内容
            9.1.1 如果您是文章、图片等等资料的版权所有人，请与@@@联系并说明具体文章标题，@@@会及时加上版权信息，如果您反对@@@的使用， 本着对版权人尊重的原则，@@@会立即取消有版权问题的内容。
            9.1.2 在本网站发表、转载的文章仅代表作者本人观点，本网站没有义务查实文章或图片、音频、视频文件的出处及其真实性。
            9.1.3 本网站上用户所发表的文章及其它附属品(如示例代码、截图及音、视频等)，如果侵犯了第三方的知识产权或其他权利， 责任由作者或转载者本人承担，本网站对此不承担责任。
            9.2 其他说明
            9.2.1 @@@对于任何包含、经由、或链接、下载或从任何与本网站有关服务(以下简称「服务」)所获得的资讯、内容或广告(以下简称「资料」)，
             不声明或保证其内容的正确性或可靠性；并且，对于您通过「服务」上的广告、资讯或邀约而展示、购买或取得的任何产品、资讯或资料(「产品」)，
             本网亦不负品质保证的责任。 您于此接受并承认信赖任何「资料」所生的风险应自行承担。@@@，有权但无此义务，改善或更正在「服务」或「资料」任何部分的错误或疏失。
            9.2.2 @@@的服务与资料是基于「现状」提供，而且@@@明确地表示拒绝对于「服务」、「资料」或「产品」给予任何明示或暗示的保证，包括但不限于， 得为商业使用或适合于特定目的的保证。
            @@@对于因「服务」、「资料」或「产品」所生的任何直接、间接、附带的或因此而导致的衍生性损失概不负责。
            9.2.3 @@@尊重他人的任何权利 ( 包括知识产权 ) ，同时也要求@@@的使用者也尊重他人之权利。在适当情况下，自行决定终止侵害或违反他人权利的使用者的帐号。
            9.2.4 @@@不担保有关网络服务一定能满足用户的全部要求，也不担保网络服务不会受中断，对网络服务的及时性、安全性、准确性都不作担保。
            9.2.5 当本网站以链接形式推荐其他网站内容时，由于本站并不控制相关网站和资源，因此访问者需理解并同意，本站并不对这些网站或资源的可用性负责，
             且不保证从这些网站获取的任何内容、产品、服务或其他材料的真实性、合法性，对于任何因使用或信赖从此类网站或资源上获取的内容、产品、 服务或其他材料而造成(或声称造成)的任何直接或间接损失，本站均不承担任何责任。
             发生下列情况时，@@@亦毋需承担任何责任。
            a 、由于您将用户密码告知他人或与他人共享注册帐户，由此导致的任何个人资料泄露。
            b 、任何由于黑客政击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等影响网络正常经营之不可抗力而造成的个人资料泄露、丢失、被盗用或被篡改等。
            c 、由于与本网站链接的其它网站所造成的个人资料泄露及由此而导致的任何法律争议和后果。
            9.3、@@@文责说明
            9.3.1. @@@的词条内容为网络协作资料，参与协作者可拥有署名权，受法律保护。
            9.3.2. 不得在@@@上复制、发布、传播以下信息：
            ◆反对宪法所确定的基本原则的；
            ◆危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            ◆损害国家荣誉和利益的；
            ◆煽动民族仇恨、民族歧视，破坏民族团结的；
            ◆破坏国家宗教政策，宣扬邪教和封建迷信的；
            ◆散布谣言，扰乱社会秩序，破坏社会稳定的；
            ◆散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            ◆侮辱或者诽谤他人，侵害他人合法权益的；
            ◆含有法律、行政法规禁止的其他内容的。
            9.3.3. 不利用@@@从事以下活动：
            ◆未经允许，进入计算机信息网络或者使用计算机信息网络资源；
            ◆未经允许，对计算机信息网络功能进行删除、修改或者增加；
            ◆未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加；
            ◆故意制作、传播计算机病毒等破坏性程序；
            ◆其他危害计算机信息网络安全的行为。
            9.3.4. 本网站文章仅代表作者本人的观点，不代表本网站的观点和看法，与本网站立场无关，文责作者自负。
            9.3.5. 本网站郑重提醒访问者：请在转载有关文章时务必尊重该文章的版权、著作权； 如果您发现有您未署名的文章，请立即和@@@联系，@@@会在第一时间加上您的署名或做相关处理。
            @@@：服务条款 版权、名誉权争议及损害赔偿责任
            10.1 用户及访问者理解：本网内容系由网友编辑上传，如发生涉嫌侵犯版权、名誉权、肖像权等内容请及时与本网联系， 联系时请附上身份证明、企业营业执照、权利权属证明、具体侵权网址、诉求、有效联系方式等证件、材料及信息。
            本网将会本着尊重他人合法权利的原则对侵权信息予以移除。
            10.2 用户同意保障和维护@@@及其他用户的利益，如因用户违反有关法律、法规或本服务条款的任何条款而给@@@或任何其他第三人造成损失，
             用户同意承担由此造成的损害赔偿责任。@@@对用户使用网络服务所产生的任何直接、间接、偶然、特殊及继起的损害不负责任，
              这些损害可能来自：不正当使用网络服务(含使用侵权信息)、在网上购买商品或进行同类型服务、在网上进行交易、非法使用网络服务或用户传送的信息有所变动。
            @@@：服务条款 关于协议修改
            11.1 @@@将有权随时修改本协议的有关条款，一旦本协议的内容发生变动，@@@将会通过适当方式向其前向用户提示计划修改内容。
            11.2 如果不同意@@@对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受@@@对本协议相关条款所做的修改。
            @@@：服务条款 适用法律
            12.1 本服务条款的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。
             如本服务条款与中华人民共和国法律相抵触时，则该等条款将按法律规定重新修订，而其它条款则依旧有效并具有法律效力。
             如双方就本服务条款内容或其执行发生任何争议，双方应尽量友好协商解决；
             协商不成时，由@@@所在地的人民法院进行管辖。
            @@@：服务条款 其他规定
            13.1 本服务条款中的标题仅为方便而设，在解释本服务条款时应被忽略。
        </div>
    );
    Modal.alert('注册协议', content);
};
